# AceleraDev Codenation - Semana 2

### Túlio Vieira de Souza | Data Scientist

## Manipulando dados

In [1]:
#Importando os pacotes
import pandas as pd
import numpy as np

In [2]:
#acessando o help dos pacotes
pd?

### Dicionarios

In [3]:
#Criando um dicionário com os dados
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

In [4]:
#para printar o dicionáario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#verificando o tipo do dicionario
type(dados)

dict

In [6]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [7]:
#Acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [8]:
#Acessando uma posicao especifica de um dicionario
dados['acessos'][2]

300

In [9]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][2]

'instagram'

In [10]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

### Listas

In [11]:
type([1,2,3])

list

In [12]:
#Criando uma lista
lista = [200, 200 , 300 ,800, 200]

In [13]:
#printando a lista
lista

[200, 200, 300, 800, 200]

In [14]:
#Vendo valores especificos
lista[1]

200

In [15]:
#fatia da lista
lista[:3]

[200, 200, 300]

In [16]:
# Adicionando a lista ao dicionario 
dados['lista'] = lista

In [17]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [18]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [19]:
#Criar um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [20]:
#acessando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [21]:
#printando os primeiros casos do dataframe
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [22]:
#Verificando o formato do dataframe
dataframe.shape

(5, 5)

In [23]:
QQRNOME = dataframe

In [24]:
QQRNOME.shape

(5, 5)

In [25]:
type(QQRNOME)

pandas.core.frame.DataFrame

In [26]:
#Verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [28]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [29]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [30]:
#Acessando uma coluna especifica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [31]:
# Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [32]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [33]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [34]:
# Removendo colunas
dataframe.drop(columns = ['acessos','site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [35]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [36]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [37]:
#Acessando valores especificos
dataframe['acessos'][1]

200

In [38]:
#Acessando fatia de coluna especifica
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [39]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [40]:
### Fatiando os dados usando o iloc (linhas | colunas)
dataframe.iloc[3:,4:]

   lista  nova_coluna
3    800            4
4    200            5

In [41]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [42]:
#Fatiar os dados usando o loc (indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4

In [43]:
#Selecionando colunas especificas
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [44]:
#Passando os valores atraves de lista
filtro = ['canal_venda', 'acessos']

In [45]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [46]:
# Usando o metodo info()
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
 5   nova_coluna  5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 368.0+ bytes

In [47]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [48]:
#Pivotando os dados (coluna)
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')
aux

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

In [49]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [50]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [51]:
aux

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [52]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [53]:
# Mudando as colunas usando o comando melt
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [54]:
#Resetando o indice do dataframe
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista',
       'nova_coluna'],
      dtype='object')

In [55]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [56]:
#aux.reset_index()

In [57]:
aux

   index canal_venda  acessos   site   vendas  lista  nova_coluna
0      0    facebook      100  site1  1000.52    200            1
1      1     twitter      200  site1  1052.34    200            2
2      2   instagram      300  site2  2002.00    300            3
3      3    linkedin      400  site2  5000.00    800            4
4      4    facebook      500  site3   300.00    200            5

In [58]:
#Exemplo do comando melt
# não funciona
#aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

In [59]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [60]:
#Somando as colunas do dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
nova_coluna                                          15
dtype: object

In [61]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [62]:
#Somando as linhas do dataframe
# ignora os que são caracteres
dataframe.sum(axis = 1)

0    1301.52
1    1454.34
2    2605.00
3    6204.00
4    1005.00
dtype: float64

In [63]:
#Calculando a mediana das colunas numericas
print('Por linha: ',dataframe.median(axis= 1) )
print('Por coluna: ', dataframe.median())

Por linha:  0    150.0
1    200.0
2    300.0
3    600.0
4    250.0
dtype: float64
Por coluna:  acessos         300.00
vendas         1052.34
lista           200.00
nova_coluna       3.00
dtype: float64

In [64]:
#Calculando a media das colunas númericas
dataframe.mean()

acessos         300.000
vendas         1870.972
lista           340.000
nova_coluna       3.000
dtype: float64

In [65]:
#Calculando o desvio padrão das colunas numericas
dataframe.std()

acessos         158.113883
vendas         1850.931024
lista           260.768096
nova_coluna       1.581139
dtype: float64

In [66]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

          acessos       vendas       lista  nova_coluna
count    5.000000     5.000000    5.000000     5.000000
mean   300.000000  1870.972000  340.000000     3.000000
std    158.113883  1850.931024  260.768096     1.581139
min    100.000000   300.000000  200.000000     1.000000
25%    200.000000  1000.520000  200.000000     2.000000
50%    300.000000  1052.340000  200.000000     3.000000
75%    400.000000  2002.000000  300.000000     4.000000
max    500.000000  5000.000000  800.000000     5.000000

In [67]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [68]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1   300.00  200.0            1
1         NaN      200  site2  1000.52    NaN            2
2         NaN      300    NaN  1052.34    NaN            3
3         NaN      400    NaN  2002.00    NaN            4
4         NaN      500    NaN  5000.00    NaN            5

In [69]:
# Valor maximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
nova_coluna          5
dtype: object

In [70]:
#Valor minimo por coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
nova_coluna           1
dtype: object

In [71]:
#Printando o numero de unicos
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
nova_coluna    5
dtype: int64

In [72]:
#Contando valores unicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
linkedin     1
instagram    1
twitter      1
Name: canal_venda, dtype: int64

In [73]:
#Valores unicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [74]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [75]:
# Usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [76]:
# Usando o groupby com valores numericos
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [77]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [78]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [79]:
dataframe.groupby('site')['canal_venda'].nunique()

site
site1    2
site2    2
site3    1
Name: canal_venda, dtype: int64

In [80]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [81]:
#Usando o groupby com a função agg
dataframe.groupby('canal_venda').agg({'site': 'unique',
                                     'acessos': 'sum',
                                     'vendas':'min'})

                       site  acessos   vendas
canal_venda
facebook     [site1, site3]      600   300.00
instagram           [site2]      300  2002.00
linkedin            [site2]      400  5000.00
twitter             [site1]      200  1052.34

In [82]:
#Correlações entre variaveis
dataframe.corr(method = 'spearman')
# default
#dataframe.corr(method = 'pearson')

             acessos    vendas     lista  nova_coluna
acessos      1.00000  0.000000  0.335410      1.00000
vendas       0.00000  1.000000  0.894427      0.00000
lista        0.33541  0.894427  1.000000      0.33541
nova_coluna  1.00000  0.000000  0.335410      1.00000

In [83]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [84]:
#Criando variaveis categoricas por fatia de variavel numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [85]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna categoria_vendas
0    facebook      100  site1  1000.52    200            1         0 a 1500
1     twitter      200  site1  1052.34    200            2         0 a 1500
2   instagram      300  site2  2002.00    300            3      2000 a 8000
3    linkedin      400  site2  5000.00    800            4      2000 a 8000
4    facebook      500  site3   300.00    200            5         0 a 1500

In [86]:
#Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [87]:
dataframe

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300

In [88]:
#Juntando dois dataframes | Criando o dataframe_2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

dataframe_2

    site   suporte
0  site1    Carlos
1  site1    Carlos
2  site2     Maria
3  site2     Maria
4  site3  Ezequiel

In [89]:
#Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300,Ezequiel

In [90]:
#Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [91]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [92]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300

In [93]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [94]:
json

,formatVersion,disclaimer,publicationDate,offers
A4B,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'A4B', 'versionIndexUrl': '/offe..."
AWSAmplify,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'AWSAmplify', 'versionIndexUrl':..."
AWSAppSync,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'AWSAppSync', 'versionIndexUrl':..."
AWSBackup,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'AWSBackup', 'versionIndexUrl': ..."
AWSBudgets,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'AWSBudgets', 'versionIndexUrl':..."
...,...,...,...,...
comprehendmedical,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'comprehendmedical', 'versionInd..."
datapipeline,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'datapipeline', 'versionIndexUrl..."
mobileanalytics,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'mobileanalytics', 'versionIndex..."
transcribe,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'transcribe', 'versionIndexUrl':..."
translate,v1.0,This pricing list is for informational purpose...,2020-04-19T02:26:45Z,"{'offerCode': 'translate', 'versionIndexUrl': ..."

In [95]:
json['offers'][99]

{'offerCode': 'AmazonMQ',
 'versionIndexUrl': '/offers/v1.0/aws/AmazonMQ/index.json',
 'currentVersionUrl': '/offers/v1.0/aws/AmazonMQ/current/index.json',
 'currentRegionIndexUrl': '/offers/v1.0/aws/AmazonMQ/current/region_index.json'}

In [96]:
json.reset_index(inplace = True)

In [97]:
json['index']

0                    A4B
1             AWSAmplify
2             AWSAppSync
3              AWSBackup
4             AWSBudgets
             ...
143    comprehendmedical
144         datapipeline
145      mobileanalytics
146           transcribe
147            translate
Name: index, Length: 148, dtype: object

## Imputação de dados

Ao fazer inputação nos dados, os **valores inputados** no **TESTE** devem ser os **valores aprendidos/vistos no TREINO !!!**

In [158]:
df = pd.read_csv('train.csv')

In [99]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [100]:
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})

In [101]:
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.198653
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [102]:
#Dados númericos : média ou mediana
#df['Age'] = df['Age'].fillna(df['Age'].mean())
#df['Age'] = df['Age'].fillna(df['Age'].median())

# cuidado porque mode retorna time sereis pandas
df['Age'] = df['Age'].fillna( int(df['Age'].mode()) )

In [103]:
print(type(df['Age'].median()),'\n', type(df['Age'].mean()),'\n', type(df['Age'].mode()))

<class 'numpy.float64'>
 <class 'numpy.float64'>
 <class 'pandas.core.series.Series'>

In [104]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,24.0,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [105]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [106]:
#Dados categoricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [107]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Unknown,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Unknown,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Unknown,S

In [108]:
df['Cabin'].value_counts()

Unknown        687
C23 C25 C27      4
G6               4
B96 B98          4
D                3
              ...
E31              1
C87              1
C70              1
A6               1
C50              1
Name: Cabin, Length: 148, dtype: int64

In [109]:
df.shape[0]

891

In [110]:
# seleciona um conjunto de colunas pelo NOMES
df.loc[:, 'Name':'Parch']

,Name,Sex,Age,SibSp,Parch
0,"Braund, Mr. Owen Harris",male,22.0,1,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,"Heikkinen, Miss. Laina",female,26.0,0,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,"Allen, Mr. William Henry",male,35.0,0,0
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,0,0
887,"Graham, Miss. Margaret Edith",female,19.0,0,0
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,24.0,1,2
889,"Behr, Mr. Karl Howell",male,26.0,0,0
890,"Dooley, Mr. Patrick",male,32.0,0,0

In [111]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [112]:
# agrupando dentro de dois grupos
df.groupby(['Sex','Survived']).agg({'Age':'mean'})

                       Age
Sex    Survived
female 0         24.827160
       1         28.098712
male   0         29.860043
       1         26.795138

In [113]:
df.groupby(['Sex','Survived'])['Age'].agg('mean')

Sex     Survived
female  0           24.827160
        1           28.098712
male    0           29.860043
        1           26.795138
Name: Age, dtype: float64

In [117]:
df.groupby(['Sex','Survived']).agg({'Age': ['min', 'max'],
                              'Pclass': ['min', 'max'],
                              'Fare': 'mean'}).round(0)

                 Age       Pclass      Fare
                 min   max    min max  mean
Sex    Survived
female 0         2.0  57.0      1   3  23.0
       1         1.0  63.0      1   3  52.0
male   0         1.0  74.0      1   3  22.0
       1         0.0  80.0      1   3  41.0

In [118]:
# ordenando valores decrescente
df.sort_values('Fare', ascending=False, inplace=True)

In [119]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,Unknown,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S

In [126]:
# mudando o tipo da coluna para categórica (fatores com ordem)
df['Embarked'] = df['Embarked'].astype('category')

# df['Embarked'] = df['Embarked'].astype('category',
#                                        categories = ['Q', 'C', 'S'],
#                                        ordered=True)

In [129]:
df['Embarked'].dtypes

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 258 to 674
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     889 non-null    category
dtypes: category(1), float64(2), int64(5), object(4)
memory usage: 84.5+ KB

In [131]:
# filtros com operações lógicas
fareMasc = df['Fare'] > 500
idadeMac = df['Age'] > 70
sexMac = df['Sex'] == 'female'

In [135]:
# and
df[fareMasc & sexMac].shape

(1, 12)

In [136]:
# or
df[fareMasc | idadeMac].shape

(8, 12)

In [157]:
df.head()

     passengerid  survived  pclass                      name     sex   age  sibsp  parch    ticket      fare        cabin embarked
258          259         1       1          Ward, Miss. Anna  female  35.0      0      0  PC 17755  512.3292      Unknown        C
737          738         1       1    Lesurer, Mr. Gustave J    male  35.0      0      0  PC 17755  512.3292         B101        C
679          680         1       1  Cardeza, Mr. Thomas D...    male  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
88            89         1       1  Fortune, Miss. Mabel ...  female  23.0      3      2     19950  263.0000  C23 C25 C27        S
27            28         0       1  Fortune, Mr. Charles ...    male  19.0      3      2     19950  263.0000  C23 C25 C27        S

In [159]:
df[
    ((df['Fare'] >= 200) & (df['Fare'] <= 1000))
    & (df['Sex'] == 'male')
    & (df['Age'] < df['Age'].quantile(0.25))
]

    PassengerId  Survived  Pclass                      Name   Sex   Age  SibSp  Parch Ticket   Fare        Cabin Embarked
27           28         0       1  Fortune, Mr. Charles ...  male  19.0      3      2  19950  263.0  C23 C25 C27        S

In [162]:
# criando coluna coluna com Apply
def idade(x):
    if x < 28:
        return 'jovem'
    elif x < 45:
        return 'adulto'
    else:
        return 'idoso'

df['idadeDesc'] = df['Age'].apply(idade)

df.head()

   PassengerId  Survived  Pclass                      Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked idadeDesc
0            1         0       3   Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500   NaN        S     jovem
1            2         1       1  Cumings, Mrs. John Br...  female  38.0      1      0          PC 17599  71.2833   C85        C    adulto
2            3         1       3    Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S     jovem
3            4         1       1  Futrelle, Mrs. Jacque...  female  35.0      1      0            113803  53.1000  C123        S    adulto
4            5         0       3  Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500   NaN        S    adulto

## Limpando nomes das colunas

In [152]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [153]:
df.columns = [x.lower() for x in df.columns]

In [155]:
df.head()

     passengerid  survived  pclass                      name     sex   age  sibsp  parch    ticket      fare        cabin embarked
258          259         1       1          Ward, Miss. Anna  female  35.0      0      0  PC 17755  512.3292      Unknown        C
737          738         1       1    Lesurer, Mr. Gustave J    male  35.0      0      0  PC 17755  512.3292         B101        C
679          680         1       1  Cardeza, Mr. Thomas D...    male  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
88            89         1       1  Fortune, Miss. Mabel ...  female  23.0      3      2     19950  263.0000  C23 C25 C27        S
27            28         0       1  Fortune, Mr. Charles ...    male  19.0      3      2     19950  263.0000  C23 C25 C27        S

# Truques do Pandas

Configurar quantidade de linhas e colunas para mostrar (head ou tail).

In [138]:
def start():
    options = {
        'display': {
            'max_columns': None,
            'max_colwidth': 25,
            'expand_frame_repr': False,  # Don't wrap to multiple pages
            'max_rows': 14,
            'max_seq_items': 50,         # Max length of printed sequence
            'precision': 4,
            'show_dimensions': False
        },
        'mode': {
            'chained_assignment': None   # Controls SettingWithCopyWarning
        }
    }

    for category, option in options.items():
        for op, value in option.items():
            pd.set_option(f'{category}.{op}', value)  # Python 3.6+

if __name__ == '__main__':
    start()
    del start  # Clean up namespace in the interpreter

In [139]:
pd.__name__

'pandas'

## Expressão Regular

In [140]:
addr = pd.Series([
        'Washington, D.C. 20003',
        'Brooklyn, NY 11211-1755',
        'Omaha, NE 68154',
        'Pittsburgh, PA 15211'])

In [143]:
addr.head()

0     Washington, D.C. 20003
1    Brooklyn, NY 11211-1755
2            Omaha, NE 68154
3       Pittsburgh, PA 15211
dtype: object

In [144]:
regex = (r'(?P<city>[A-Za-z ]+), '      # One or more letters
         r'(?P<state>[A-Z]{2}) '        # 2 capital letters
         r'(?P<zip>\d{5}(?:-\d{4})?)')  # Optional 4-digit extension

In [145]:
addr.str.replace('.', '').str.extract(regex)

         city state         zip
0  Washington    DC       20003
1    Brooklyn    NY  11211-1755
2       Omaha    NE       68154
3  Pittsburgh    PA       15211

# Datas

In [146]:
daterng = pd.Series(pd.date_range('2017', periods=9, freq='Q'))

In [147]:
daterng

0   2017-03-31
1   2017-06-30
2   2017-09-30
3   2017-12-31
4   2018-03-31
5   2018-06-30
6   2018-09-30
7   2018-12-31
8   2019-03-31
dtype: datetime64[ns]

In [148]:
# dia da semana
daterng.dt.day_name()

0      Friday
1      Friday
2    Saturday
3      Sunday
4    Saturday
5    Saturday
6      Sunday
7      Monday
8      Sunday
dtype: object

In [150]:
# filtra só segunda metade do ano (bimestres 3 e 4)
daterng[daterng.dt.quarter > 2]

2   2017-09-30
3   2017-12-31
6   2018-09-30
7   2018-12-31
dtype: datetime64[ns]

In [151]:
# filtra se é último dia do ano
daterng[daterng.dt.is_year_end]

3   2017-12-31
7   2018-12-31
dtype: datetime64[ns]

# Manipulação de Séries Temporais

Um princípio ao manusear séries temporais é remover a coluna tipo data e colocá-la com índice das linhas.

In [197]:
from datetime import datetime
import numpy as np

# cria vetor de datas com intervalo de hora em hora
date_rng = pd.date_range(start='1/1/2018', end='1/08/2018', freq='H')
date_rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00', '2018-01-01 03:00:00',
               '2018-01-01 04:00:00', '2018-01-01 05:00:00',
               '2018-01-01 06:00:00', '2018-01-01 07:00:00',
               '2018-01-01 08:00:00', '2018-01-01 09:00:00',
               ...
               '2018-01-07 15:00:00', '2018-01-07 16:00:00',
               '2018-01-07 17:00:00', '2018-01-07 18:00:00',
               '2018-01-07 19:00:00', '2018-01-07 20:00:00',
               '2018-01-07 21:00:00', '2018-01-07 22:00:00',
               '2018-01-07 23:00:00', '2018-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq='H')

In [198]:
date_rng[0]

Timestamp('2018-01-01 00:00:00', freq='H')

In [199]:
type(date_rng[0])
#returns
#pd._libs.tslib.Timestamp

pandas._libs.tslibs.timestamps.Timestamp

In [200]:
df = pd.DataFrame(date_rng, columns=['date'])

df['data'] = np.random.randint(0,100, size=(len(date_rng)))

df.head(15)

                  date  data
0  2018-01-01 00:00:00    93
1  2018-01-01 01:00:00    76
2  2018-01-01 02:00:00     3
3  2018-01-01 03:00:00    73
4  2018-01-01 04:00:00    95
..                 ...   ...
10 2018-01-01 10:00:00    50
11 2018-01-01 11:00:00    48
12 2018-01-01 12:00:00    37
13 2018-01-01 13:00:00    95
14 2018-01-01 14:00:00    28

In [201]:
# convertendo coluna data para index
df['datetime'] = pd.to_datetime(df['date'])

df = df.set_index('datetime')

df.drop(['date'], axis=1, inplace=True)

df.head()

                     data
datetime
2018-01-01 00:00:00    93
2018-01-01 01:00:00    76
2018-01-01 02:00:00     3
2018-01-01 03:00:00    73
2018-01-01 04:00:00    95

In [202]:
# convertendo string em data
string_date_rng_2 = ['June-01-2018', 'June-02-2018', 'June-03-2018']

timestamp_date_rng_2 = [datetime.strptime(x,'%B-%d-%Y') for x in string_date_rng_2]

timestamp_date_rng_2

[datetime.datetime(2018, 6, 1, 0, 0),
 datetime.datetime(2018, 6, 2, 0, 0),
 datetime.datetime(2018, 6, 3, 0, 0)]

In [203]:
print(timestamp_date_rng_2[0])

2018-06-01 00:00:00

In [204]:
# colocando em um DF
df2 = pd.DataFrame(timestamp_date_rng_2, columns=['date'])

df2

        date
0 2018-06-01
1 2018-06-02
2 2018-06-03

In [205]:
df.head(6)

                     data
datetime
2018-01-01 00:00:00    93
2018-01-01 01:00:00    76
2018-01-01 02:00:00     3
2018-01-01 03:00:00    73
2018-01-01 04:00:00    95
2018-01-01 05:00:00    51

In [206]:
# filtrando por dias, dia 02
df[df.index.day == 2]

                     data
datetime
2018-01-02 00:00:00    14
2018-01-02 01:00:00    94
2018-01-02 02:00:00    53
2018-01-02 03:00:00    65
2018-01-02 04:00:00    79
...                   ...
2018-01-02 19:00:00    33
2018-01-02 20:00:00    85
2018-01-02 21:00:00    65
2018-01-02 22:00:00    26
2018-01-02 23:00:00    39

In [207]:
# filtrando um dia específico
df['2018-01-03']

                     data
datetime
2018-01-03 00:00:00    87
2018-01-03 01:00:00     7
2018-01-03 02:00:00    43
2018-01-03 03:00:00    17
2018-01-03 04:00:00    38
...                   ...
2018-01-03 19:00:00    78
2018-01-03 20:00:00    67
2018-01-03 21:00:00    71
2018-01-03 22:00:00    98
2018-01-03 23:00:00    11

In [208]:
# intervalo de datas
df['2018-01-04':'2018-01-06']

                     data
datetime
2018-01-04 00:00:00    65
2018-01-04 01:00:00    76
2018-01-04 02:00:00    63
2018-01-04 03:00:00    16
2018-01-04 04:00:00    43
...                   ...
2018-01-06 19:00:00    95
2018-01-06 20:00:00    37
2018-01-06 21:00:00    61
2018-01-06 22:00:00    80
2018-01-06 23:00:00    93

In [209]:
# calculando as médias diárias
df.resample('D').mean()

               data
datetime
2018-01-01  54.6667
2018-01-02  56.9583
2018-01-03  40.8750
2018-01-04  53.0000
2018-01-05  43.1250
2018-01-06  60.1250
2018-01-07  54.8333
2018-01-08  23.0000

In [210]:
df['2018-01-01'].mean() == df.resample('D').mean().iloc[0,0]

data    True
dtype: bool

In [211]:
# criando coluna com soma de 3 dias anteriores
df['rolling_sum'] = df.rolling(3).sum()
df.head(10)

                     data  rolling_sum
datetime
2018-01-01 00:00:00    93          NaN
2018-01-01 01:00:00    76          NaN
2018-01-01 02:00:00     3        172.0
2018-01-01 03:00:00    73        152.0
2018-01-01 04:00:00    95        171.0
2018-01-01 05:00:00    51        219.0
2018-01-01 06:00:00     7        153.0
2018-01-01 07:00:00    72        130.0
2018-01-01 08:00:00    70        149.0
2018-01-01 09:00:00    19        161.0

In [213]:
# preenchendo misisngs com valores mais proximos depois
# method='pad' preenche com valores antes
df['rolling_sum_backfilled'] = df['rolling_sum'].fillna(method='backfill')
df.head(10)

                     data  rolling_sum  rolling_sum_backfilled
datetime
2018-01-01 00:00:00    93          NaN                   172.0
2018-01-01 01:00:00    76          NaN                   172.0
2018-01-01 02:00:00     3        172.0                   172.0
2018-01-01 03:00:00    73        152.0                   152.0
2018-01-01 04:00:00    95        171.0                   171.0
2018-01-01 05:00:00    51        219.0                   219.0
2018-01-01 06:00:00     7        153.0                   153.0
2018-01-01 07:00:00    72        130.0                   130.0
2018-01-01 08:00:00    70        149.0                   149.0
2018-01-01 09:00:00    19        161.0                   161.0